<?xml version="1.0" ?>
<net name="lw_pose_32" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,368,368"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>368</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv/backbone_conv1_bn/FusedBatchNormV3/mean/Fused_Mul_85078509_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="32,3,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv/backbone_conv1_conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>368</dim>
					<dim>368</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_7972/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3456" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv/backbone_conv1_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv/backbone_conv1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1234212345_const" type="Const" version="opset1">
			<data element_type="f32" offset="3584" shape="32,1,1,3,3" size="1152"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw/backbone_convdw1_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw/backbone_convdw1_bn/FusedBatchNormV3/mean/Fused_Mul_85118513_const" type="Const" version="opset1">
			<data element_type="f32" offset="4736" shape="64,32,1,1" size="8192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw/backbone_convdw1_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_79757980/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="12928" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw/backbone_convdw1_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw/backbone_convdw1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1238612389_const" type="Const" version="opset1">
			<data element_type="f32" offset="13184" shape="64,1,1,3,3" size="2304"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_1/backbone_convdw2_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>184</dim>
					<dim>184</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_1/backbone_convdw2_bn/FusedBatchNormV3/mean/Fused_Mul_85158517_const" type="Const" version="opset1">
			<data element_type="f32" offset="15488" shape="128,64,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_1/backbone_convdw2_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_79837988/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="48256" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_1/backbone_convdw2_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_1/backbone_convdw2_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="1235412357_const" type="Const" version="opset1">
			<data element_type="f32" offset="48768" shape="128,1,1,3,3" size="4608"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_2/backbone_convdw3_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_2/backbone_convdw3_bn/FusedBatchNormV3/mean/Fused_Mul_85198521_const" type="Const" version="opset1">
			<data element_type="f32" offset="53376" shape="128,128,1,1" size="65536"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_2/backbone_convdw3_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_79917996/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="118912" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_2/backbone_convdw3_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_2/backbone_convdw3_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="1235012353_const" type="Const" version="opset1">
			<data element_type="f32" offset="119424" shape="128,1,1,3,3" size="4608"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_3/backbone_convdw4_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>92</dim>
					<dim>92</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_3/backbone_convdw4_bn/FusedBatchNormV3/mean/Fused_Mul_85238525_const" type="Const" version="opset1">
			<data element_type="f32" offset="124032" shape="256,128,1,1" size="131072"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_3/backbone_convdw4_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_79998004/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="255104" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_3/backbone_convdw4_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_3/backbone_convdw4_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="1239012393_const" type="Const" version="opset1">
			<data element_type="f32" offset="256128" shape="256,1,1,3,3" size="9216"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_4/backbone_convdw5_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_4/backbone_convdw5_bn/FusedBatchNormV3/mean/Fused_Mul_85278529_const" type="Const" version="opset1">
			<data element_type="f32" offset="265344" shape="256,256,1,1" size="262144"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_4/backbone_convdw5_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_80078012/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="527488" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_4/backbone_convdw5_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_4/backbone_convdw5_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="1237812381_const" type="Const" version="opset1">
			<data element_type="f32" offset="528512" shape="256,1,1,3,3" size="9216"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_5/backbone_convdw6_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_5/backbone_convdw6_bn/FusedBatchNormV3/mean/Fused_Mul_85318533_const" type="Const" version="opset1">
			<data element_type="f32" offset="537728" shape="512,256,1,1" size="524288"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_5/backbone_convdw6_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="data_add_80158020/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1062016" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_5/backbone_convdw6_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_5/backbone_convdw6_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="1238212385_const" type="Const" version="opset1">
			<data element_type="f32" offset="1064064" shape="512,1,1,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_6/backbone_convdw7_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data dilations="2,2" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_6/backbone_convdw7_bn/FusedBatchNormV3/mean/Fused_Mul_85358537_const" type="Const" version="opset1">
			<data element_type="f32" offset="1082496" shape="512,512,1,1" size="1048576"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_6/backbone_convdw7_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="data_add_80238028/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2131072" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_6/backbone_convdw7_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_6/backbone_convdw7_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="1236212365_const" type="Const" version="opset1">
			<data element_type="f32" offset="2133120" shape="512,1,1,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_7/backbone_convdw8_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_7/backbone_convdw8_bn/FusedBatchNormV3/mean/Fused_Mul_85398541_const" type="Const" version="opset1">
			<data element_type="f32" offset="2151552" shape="512,512,1,1" size="1048576"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_7/backbone_convdw8_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_80318036/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3200128" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_7/backbone_convdw8_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_7/backbone_convdw8_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1234612349_const" type="Const" version="opset1">
			<data element_type="f32" offset="3202176" shape="512,1,1,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_8/backbone_convdw9_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_8/backbone_convdw9_bn/FusedBatchNormV3/mean/Fused_Mul_85438545_const" type="Const" version="opset1">
			<data element_type="f32" offset="3220608" shape="512,512,1,1" size="1048576"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_8/backbone_convdw9_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_80398044/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="4269184" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_8/backbone_convdw9_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_8/backbone_convdw9_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="1237012373_const" type="Const" version="opset1">
			<data element_type="f32" offset="4271232" shape="512,1,1,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_9/backbone_convdw10_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_9/backbone_convdw10_bn/FusedBatchNormV3/mean/Fused_Mul_85478549_const" type="Const" version="opset1">
			<data element_type="f32" offset="4289664" shape="512,512,1,1" size="1048576"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_9/backbone_convdw10_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="data_add_80478052/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5338240" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_9/backbone_convdw10_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_9/backbone_convdw10_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="1236612369_const" type="Const" version="opset1">
			<data element_type="f32" offset="5340288" shape="512,1,1,3,3" size="18432"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_10/backbone_convdw11_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_10/backbone_convdw11_bn/FusedBatchNormV3/mean/Fused_Mul_85518553_const" type="Const" version="opset1">
			<data element_type="f32" offset="5358720" shape="512,512,1,1" size="1048576"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_10/backbone_convdw11_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="data_add_80558060/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="6407296" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_10/backbone_convdw11_sep_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/light_weight_open_pose/sequential/conv_dw_10/backbone_convdw11_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/light_weight_open_pose/cpm/conv_1/cpm_align_conv2d/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="6409344" shape="128,512,1,1" size="262144"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/light_weight_open_pose/cpm/conv_1/cpm_align_conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/light_weight_open_pose/cpm/conv_1/cpm_align_conv2d/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="6671488" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/light_weight_open_pose/cpm/conv_1/cpm_align_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/light_weight_open_pose/cpm/conv_1/cpm_align_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="1237412377_const" type="Const" version="opset1">
			<data element_type="f32" offset="6672000" shape="128,1,1,3,3" size="4608"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_11/cpm_truck1_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_11/cpm_truck1_sep_conv2d/separable_conv2d/ReadVariableOp_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="6676608" shape="128,128,1,1" size="65536"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_11/cpm_truck1_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_11/cpm_truck1_sep_conv2d/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="6742144" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_11/cpm_truck1_sep_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_11/cpm_truck1_elu/Elu" type="Elu" version="opset1">
			<data alpha="1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1239412397_const" type="Const" version="opset1">
			<data element_type="f32" offset="6742656" shape="128,1,1,3,3" size="4608"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_12/cpm_truck2_sep_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_12/cpm_truck2_sep_conv2d/separable_conv2d/ReadVariableOp_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="6747264" shape="128,128,1,1" size="65536"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_12/cpm_truck2_sep_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_12/cpm_truck2_sep_conv2d/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="6812800" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/light_weight_open_pose/cpm/sequential_1/conv_dw_12/cpm_truck2_sep_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>46</dim>
					<dim>46</dim>
				</port>
